# OpacityByClassN

```pascal
PROCEDURE OpacityByClassN(
				fillOpacityByClass : BOOLEAN;
				penOpacityByClass  : BOOLEAN);
```

```python
def vs.OpacityByClassN(fillOpacityByClass, penOpacityByClass):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fillOpacityByClass|BOOLEAN|   |
|penOpacityByClass|BOOLEAN|   |

## Examples
```pascal
OpacityByClassN(TRUE, FALSE);
```
```python
import vs

fillOpacityByClass = True
penOpacityByClass = True

vs.OpacityByClassN(fillOpacityByClass, penOpacityByClass)
```

## Version
Availability: from Vectorworks 2017

## Category
* Classes